_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 224, 224, 64)      1792      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 224, 224, 64)      0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 112, 112, 64)      36928     
_________________________________________________________________
batch_normalization_34 (Batc (None, 112, 112, 64)      256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 112, 112, 64)      0         
_________________________________________________________________
batch_normalization_35 (Batc (None, 112, 112, 64)      256       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 112, 112, 64)      0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 112, 112, 128)     73856     
_________________________________________________________________
batch_normalization_36 (Batc (None, 112, 112, 128)     512       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 112, 112, 128)     0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 56, 56, 128)       147584    
_________________________________________________________________
batch_normalization_37 (Batc (None, 56, 56, 128)       512       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 56, 56, 128)       0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 56, 56, 256)       295168    
_________________________________________________________________
batch_normalization_38 (Batc (None, 56, 56, 256)       1024      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 56, 56, 256)       0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 28, 28, 256)       590080    
_________________________________________________________________
batch_normalization_39 (Batc (None, 28, 28, 256)       1024      
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 28, 28, 256)       0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 28, 28, 512)       1180160   
_________________________________________________________________
batch_normalization_40 (Batc (None, 28, 28, 512)       2048      
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 28, 28, 512)       0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 14, 14, 512)       2359808   
_________________________________________________________________
batch_normalization_41 (Batc (None, 14, 14, 512)       2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 14, 14, 512)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 100352)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              102761472 
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 1025      
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 214,907,266
Trainable params: 107,451,713
Non-trainable params: 107,455,553
_________________________________________________________________
