__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            (None, 56, 56, 3)    0                                            
__________________________________________________________________________________________________
model_2 (Model)                 (None, 224, 224, 3)  1554755     input_5[0][0]                    
__________________________________________________________________________________________________
model_1 (Model)                 (None, 56, 56, 256)  143667240   model_2[1][0]                    
__________________________________________________________________________________________________
model_3 (Model)                 (None, 1)            107455553   model_2[1][0]                    
==================================================================================================
Total params: 252,677,548
Trainable params: 1,550,531
Non-trainable params: 251,127,017
__________________________________________________________________________________________________
